mean_clean_machine_backend/mean_clean_machine-api/app/controllers/customers_controller.rb

    def index
        customers = Customer.all
---
SELECT "customers".* FROM "customers"

    def show
        customer = Customer.find(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."params" = ? LIMIT ?  [["params", "id"], ["LIMIT", 1]]