mean_clean_machine_backend/mean_clean_machine-api/app/controllers/orders_controller.rb

    def index
        customer = Customer.find(params[:customer_id])
        orders = customer.orders.all
---
SELECT "customers".* FROM "customers" WHERE "customers"."params" = ? LIMIT ?  [["params", "customer_id"], ["LIMIT", 1]]
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
SELECT "orders".* FROM "orders"

    def create
        customer = Customer.find_by_id(params[:customer_id])
        order = customer.orders.new(params.require(:order).permit(:customer_id, :price, :item))
        if (order.save!)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT "customers".* FROM "customers" WHERE (16) LIMIT ?  [["LIMIT", 1]]
INSERT INTO "orders" ("customer_id", "price", "created_at", "updated_at", "item") VALUES (?, ?, ?, ?, ?)  [["customer_id", 15], ["price", 10], ["created_at", "2021-08-29 10:32:35.385745"], ["updated_at", "2021-08-29 10:32:35.385745"], ["item", "Pants"]]

    def update
        customer = Customer.find_by_id(params[:customer_id])
        order = customer.orders.find_by_id(params[:id])
        order.update(price: params[:price], item: params[:item])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ? AND "orders"."id" = ? LIMIT ?  [["customer_id", 10], ["id", 6], ["LIMIT", 1]]
UPDATE "orders" SET "price" = ?, "updated_at" = ?, "item" = ? WHERE "orders"."id" = ?  [["price", 10], ["updated_at", "2021-08-29 12:42:18.013598"], ["item", "Shirt"], ["id", 6]]